{
  "name": "90 irregular verbs-210 regular verbs in 7 different tenses (13 part)",
  "phrases": [
    {
      "en": "He's promised to do it so many times",
      "ru": "Он обещал сделать это так много раз"
    },
    {
      "en": "I haven't answered this letter yet",
      "ru": "Я еще не ответил на это письмо"
    },
    { "en": "He's just made a mistake", "ru": "Он только что сделал ошибку" },
    {
      "en": "When I came there, I realized that I had missed the bus",
      "ru": "Когда я пришел туда, я осознал, что пропустил автобус"
    },
    {
      "en": "What is he talking about? I can't understand it",
      "ru": "О чем он говорит? Я не могу понять это"
    },
    {
      "en": "Не tries to travel every year",
      "ru": "Он старается путешествовать каждый год"
    },
    { "en": "I haven't chosen the answer yet", "ru": "Я еще не выбрал ответ" },
    {
      "en": "He's borrowed a very big sum of money this month",
      "ru": "Он занял очень большую сумму денег в этом месяце"
    },
    {
      "en": "While he was carrying her bag, they were talking about something",
      "ru": "Пока он нес ее сумку, они говорили о чем-то"
    },
    {
      "en": "The boy was playing this game all day",
      "ru": "Мальчик играл в эту игру весь день"
    },
    {
      "en": "The teacher asked them to fill in the gaps",
      "ru": "Учитель попросил их заполнить пропуски"
    },
    { "en": "Fill in the form, please!", "ru": "Заполните форму, пожалуйста!" },
    {
      "en": "He's just apologized for his rude behaviour",
      "ru": "Он только что извинился за свое грубое поведение"
    },
    {
      "en": "You can copy other students' mistakes there",
      "ru": "Вы можете копировать ошибки других студентов там"
    },
    {
      "en": "You can copy other people's mistakes there",
      "ru": "Ты можешь копировать ошибки других людей там"
    },
    {
      "en": "I adapted to those conditions although it was really difficult",
      "ru": "Я адаптировался к тем условиям, хотя это было действительно сложно"
    },
    {
      "en": "I haven't noticed any serious changes",
      "ru": "Я еще не заметил каких-либо серьезных изменений"
    },
    { "en": "What is he eating now?", "ru": "Что он сейчас ест?" },
    {
      "en": "I felt that I needed much more practice",
      "ru": "Я чувствовал, что мне нужно было гораздо больше практики"
    },
    {
      "en": "The sun was shining. The wind was blowing slightly. The birds were singing very beautifully",
      "ru": "Солнце светило. Ветер дул слегка. Птицы пели очень красиво"
    }
  ]
}
