{
  "name": "Diffirent Past Continious and Past Simple",
  "phrases": [
    {
      "en": "When I studied at school, I didn’t pay attention to it",
      "ru": "Когда я учился в школе, я не обращал внимание на это"
    },
    {
      "en": "When I studied at university, my friends and I often discussed it",
      "ru": "Когда я учился в университете, мы с друзьями часто обсуждали это"
    },
    {
      "en": " When I was waiting for him, I was revising the lesson",
      "ru": "Когда я ждал его, я повторял урок"
    },
    { "en": "I revised [zd] all the lessons", "ru": "Я повторил все уроки" },
    {
      "en": "While I was reading that book, I was getting more and more interested in it because the plot was so thrilling",
      "ru": "Пока я читал ту книгу, я становился все более заинтересованным этим, потому что сюжет был таким захватывающим"
    },
    {
      "en": "While I was reading that book, I was more and more interested in it because it was such a thrilling book",
      "ru": "Пока я читал ту книгу, я все более интересовался этим, потому что это была такая захватывающая книга"
    },
    {
      "en": "I got more interested in this kind of issues",
      "ru": "Я стал более интересоваться такого рода вопросами"
    },
    {
      "en": "It started raining and we decided to go home",
      "ru": "Пошел дождь, и мы решили пойти домой"
    },
    { "en": "It was snowing all day", "ru": "Весь день шел снег" },
    {
      "en": "When I arrived at the station, he was waiting for me",
      "ru": "Когда я прибыл на вокзал, он ждал меня"
    },
    {
      "en": "When it happened, I started thinking about it more seriously",
      "ru": "Когда это случилось, я стал думать об этом более серьезно"
    },
    {
      "en": "When it happened to me, I started thinking about it much more seriously",
      "ru": "Когда это случилось co мной, я стал думать об этом гораздо серьезнее"
    },
    {
      "en": "When I saw him, I asked him that question",
      "ru": "Когда я увидел его, я задал ему тот вопрос"
    },
    {
      "en": "When it started raining so heavily, I decided not to go there",
      "ru": "Когда пошел такой сильный дождь, я решил не ехать туда"
    },
    {
      "en": "When it started snowing so heavily, I decided to cancel that meeting",
      "ru": "Когда пошел такой сильный снег, я решил отменить ту встречу"
    },
    {
      "en": "What were you doing when you saw it?",
      "ru": "Что ты делал, когда ты увидел это?"
    },
    {
      "en": "What were you doing when such an unpleasant thing happened?",
      "ru": "Что ты делал, когда произошла такая неприятная вещь?"
    },
    {
      "en": "It was a very difficult situation. I was working really hard. I was trying to do my best to earn enough money to live on",
      "ru": "Это была очень сложная ситуация. Я работал действительно усердно. Я изо всех сил старался заработать достаточно денег, на которые жить"
    },
    {
      "en": "It was such a difficult situation. I was working so much. I was trying to do my best to earn enough money for a living",
      "ru": "Это была такая сложная ситуация. Я так много работал. Я старался изо всех сил, чтобы заработать достаточно денег на жизнь"
    },
    {
      "en": "The situation was getting out of control and, to be honest, I didn't know what to do",
      "ru": "Ситуация выходила из-под контроля и, честно говоря, я не знал, что делать"
    }
  ]
}
