{
  "name": "Last lesson A1",
  "phrases": [
    {
      "en": "Have you ever been to England?",
      "ru": "Ты когда-нибудь был в Англии?"
    },
    {
      "en": "Have you ever been to the United States?",
      "ru": "Ты когда-нибудь был в Соединенных Штатах?"
    },
    {
      "en": "Have you ever been to America?",
      "ru": "Ты когда-либо был в Америке?"
    },
    {
      "en": "Have you ever been to this country?",
      "ru": "Ты когда-нибудь был в этой стране?"
    },
    {
      "en": "Were you in America last year?",
      "ru": "Ты был в Америке в прошлом году?"
    },
    {
      "en": "Were you in China two years ago?",
      "ru": "Ты был в Китае два года назад?"
    },
    { "en": "Have you been to India?", "ru": "Ты был в Индии?" },
    { "en": "Have you been to China?", "ru": "Ты был в Китае?" },
    { "en": "Have you been abroad?", "ru": "Ты был за границей?" },
    {
      "en": "Have you ever been abroad?",
      "ru": "Ты когда-нибудь был за границей?"
    },
    {
      "en": "Have you ever been to Spain? Not yet",
      "ru": "Ты когда-нибудь был в Испании? Еще нет"
    },
    {
      "en": "Have you ever been to Italy? I was there last year",
      "ru": "Ты когда-нибудь был в Италии? Я был там в прошлом году"
    },
    {
      "en": "Have you ever been to the United States? I was there two years ago",
      "ru": "Ты когда-нибудь был в Соединенных Штатах? Я был там два года назад"
    },
    {
      "en": "Have you ever been to Latin America? I haven't been there yet",
      "ru": "Ты когда-нибудь был в Латинской Америке? Я еще не был там"
    },
    {
      "en": "Have you ever been to an English-speaking country? Not yet but it's in my plans",
      "ru": "Ты когда-нибудь был в англоязычной стране? Пока нет, но это в моих планах"
    },
    {
      "en": "Have you ever been to an English-speaking country? I haven't been there yet but it's in my plans",
      "ru": "Ты когда-нибудь был в англоязычной стране? Я еще не был там, но это в моих планах"
    },
    {
      "en": "I've just arrived in England",
      "ru": "Я только что прибыл в Англию"
    },
    {
      "en": "I’ve just arrived at the airport",
      "ru": "Я только что прибыл в аэропорт"
    },
    {
      "en": "He's just arrived at the party",
      "ru": "Он только что прибыл на вечеринку"
    },
    {
      "en": "He's already mentioned it during his conversation",
      "ru": "Он уже упоминал об этом во время своего разговора"
    },
    {
      "en": "She's already mentioned it during the conversation",
      "ru": "Она уже упоминала это во время разговора"
    },
    {
      "en": "As I know, they have already taken proper measures",
      "ru": "Как я знаю, они уже приняли надлежащие меры"
    },
    {
      "en": "She’s always wanted to study psychology",
      "ru": "Она всегда хотела изучать психологию"
    },
    {
      "en": "I've always wanted to devote more free time to it",
      "ru": "Я всегда хотел уделять этому больше свободного времени"
    },
    {
      "en": "I've always wanted to succeed in life",
      "ru": "Я всегда хотел добиться успеха в жизни"
    },
    { "en": "I've never thought about it", "ru": "Я никогда не думал об этом" },
    {
      "en": "То be honest, I've never considered it really seriously",
      "ru": "Если честно, я никогда не рассматривал это действительно всерьез"
    },
    {
      "en": "То be honest, I've never been to an English-speaking country but I'm going to do it one day",
      "ru": "Если честно, я никогда не был в англоязычной стране, но я собираюсь это сделать однажды"
    },
    { "en": "I've been there many times", "ru": "Я был там много раз" },
    {
      "en": "You know, I've heard it a thousand times",
      "ru": "Ты знаешь, я слышал это тысячу раз"
    },
    {
      "en": "You know, I've heard it so many times",
      "ru": "Ты знаешь, я слышал это так много раз"
    },
    {
      "en": "You know, I've been there so many times",
      "ru": "Ты знаешь, я был там так много раз"
    },
    {
      "en": "As I know, he released this album about a year ago",
      "ru": "Как я знаю, он выпустил этот альбом около года назад"
    }
  ]
}
