{
  "name": "90 irregular verbs-210 regular verbs in 7 different tenses (5 part)",
  "phrases": [
    {
      "en": "I've just arrived at the meeting",
      "ru": "Я только что прибыл на встречу"
    },
    {
      "en": "Не lay down at the end of the day",
      "ru": "Он прилег в конце дня"
    },
    {
      "en": "I decided not to follow this recommendation",
      "ru": "Я решил не следовать этой рекомендации"
    },
    { "en": "Why is he smiling?", "ru": "Почему он улыбается?" },
    {
      "en": "I discovered that they had given me the wrong information",
      "ru": "Я обнаружил, что они мне дали неверную информацию"
    },
    { "en": "I was staying at home all day", "ru": "Я сидел дома весь день" },
    { "en": "I was at home all day", "ru": "Я был дома весь день" },
    {
      "en": "Не discovered that someone had stolen his bag",
      "ru": "Он обнаружил, что кто-то украл его сумку"
    },
    { "en": "Did you wash the dishes?", "ru": "Ты помыл посуду?" },
    {
      "en": "It seems to me that it develops our analytical abilities",
      "ru": "Мне кажется, что это развивает наши аналитические способности"
    },
    {
      "en": "It was getting darker and we decided to turn back home",
      "ru": "Становилось темнее, и мы решили повернуть назад домой"
    },
    {
      "en": "The teacher divided our group into several parts",
      "ru": "Учитель разделил нашу группу на несколько частей"
    },
    {
      "en": "I divided this sum of money into three parts",
      "ru": "Я разделил эту сумму денег на три части"
    },
    {
      "en": "I’ve already tested my knowledge",
      "ru": "Я уже протестировал свои знания"
    },
    {
      "en": "When did he graduate from university?",
      "ru": "Когда он окончил университет?"
    },
    {
      "en": "I haven’t prepared for this test yet",
      "ru": "Я еще не подготовился к этому тесту"
    },
    {
      "en": "While I was preparing for this test really hard, they weren't thinking about it really seriously",
      "ru": "Пока я готовился к этому тесту действительно усердно, они не думали об этом действительно серьезно"
    },
    { "en": "I remember how it happened", "ru": "Я помню, как это произошло" },
    {
      "en": "I disagree with this statement now",
      "ru": "Я не согласен с этим утверждением сейчас"
    },
    {
      "en": "Не said that they had destroyed the building completely",
      "ru": "Он сказал, что они разрушили здание полностью"
    },
    {
      "en": "Such an example really motivates",
      "ru": "Такой пример действительно мотивирует меня"
    },
    {
      "en": "I think that we're wasting time now",
      "ru": "Я думаю, что мы тратим время впустую сейчас"
    },
    {
      "en": "When I noticed him, he was looking",
      "ru": "Когда я заметил его, он что-то искал"
    }
  ]
}
