{
  "name": "B1 lesson 4",
  "phrases": [
    {
      "en": "I've been waiting for it for an hour. I can't wait for it anymore",
      "ru": "Я жду этого час. Я больше не могу ждать этого"
    },
    {
      "en": "I've been waiting for it for so long",
      "ru": "Я так долго жду это"
    },
    {
      "en": "I’ve been waiting for a very long time",
      "ru": "Я жду очень долго"
    },
    {
      "en": "When he called me, I had been doing that work for about fifteen minutes",
      "ru": "Когда он позвонил мне, я занимался той работой около пятнадцати минут"
    },
    {
      "en": "When they arrived, we had been discussing these issues for about two hours",
      "ru": "Когда они прибыли, мы обсуждали эти вопросы около двух часов"
    },
    {
      "en": "Не had been learning English very intensively for three years before he reached an Advanced level in English",
      "ru": "Он очень интенсивно изучал английский язык в течение трех лет, прежде чем достиг продвинутого уровня в английском"
    },
    {
      "en": "Не had been studying incredibly hard for a couple of weeks before he passed his final exam",
      "ru": "Он невероятно усердно занимался пару недель, прежде чем сдал свой последний экзамен"
    },
    {
      "en": "I will have reached the next level by the time I finish this course",
      "ru": "Я достигну следующего уровня к тому времени, как закончу этот курс"
    },
    {
      "en": "Не expects that he will have earned this sum of money by next year",
      "ru": "Он ожидает, что заработает эту сумму денег к следующему году"
    },
    {
      "en": "They will have been living in America for five years by the end of this month",
      "ru": "Они будут жить в Америке пять лет к концу этого месяца"
    },
    {
      "en": "I will have been working here for a year by August",
      "ru": "Я буду работать здесь год к августу"
    },
    {
      "en": "They will have been living together for four years by next month",
      "ru": "Они будут жить вместе четыре года к следующему месяцу"
    },
    {
      "en": "Не will have reached the next level by the time he finishes studying this course",
      "ru": "Он достигнет следующего уровня к тому времени, как он закончит изучать этот курс"
    },
    {
      "en": "By the time he came home, she had been cooking for two hours",
      "ru": "К тому времени, как он пришел домой, она готовила два часа"
    },
    {
      "en": "I expect that I will have earned this sum of money by next year",
      "ru": "Я ожидаю, что заработаю эту сумму денег к следующему году"
    },
    {
      "en": "How long have you been studying here?",
      "ru": "Как долго ты здесь учишься?"
    },
    {
      "en": "I've been working here since I graduated from university",
      "ru": "Я работаю здесь с тех пор, как окончил университет"
    }
  ]
}
